OpenFOAM/2D Decay/system/parameters

x_min  0;
x_max  6.283 ; 
y_min  0 ; 
y_max  6.283  ; 
z_min   -0.05 ;  
z_max 0.05;


Grid_x   1024 ;
Grid_y 1024 ;


nu    0.00001;


Ea   180;
k0   12 ;

